In [1]:
import pandas as pd

In [37]:
odf = pd.read_pickle("datasets/dummy_df.pkl")

In [38]:
odf.head()

,type,theme,year,account_number,public,entity,country,region,population,city,...,primary_industry,primary_questionnaire_sector,s_score,c_score,o_score,r_score,e_score,e2_score,total,alpha3code
0,cid,combined,2018,58671,public,Helsingør,Denmark,Europe,62686.0,Helsingør,...,NaN,NaN,5,2,2,5,1,4,3.17,DNK
1,cid,combined,2018,31009,public,Copenhagen,Denmark,Europe,602481.0,Copenhagen,...,NaN,NaN,3,1,5,5,4,1,3.17,DNK
2,cid,combined,2018,58489,public,Hoeje-Taastrup,Denmark,Europe,50246.0,Hoeje-Taastrup,...,NaN,NaN,4,5,3,1,4,1,3.00,DNK
3,cid,combined,2018,54405,non public,Vejle,Denmark,Europe,113720.0,Vejle,...,NaN,NaN,2,4,5,4,5,2,3.67,DNK
4,cid,combined,2018,63615,public,Hillerød,Denmark,Europe,50104.0,Hillerød,...,NaN,NaN,2,2,2,3,2,4,2.50,DNK

In [39]:
df = pd.read_pickle("datasets/all_scores.pkl")

In [41]:
df = df.astype(dtype="int64", errors="ignore")

In [42]:
countries=pd.read_csv("datasets/countries_iso3166-1_alpha3.csv", delimiter=";")

In [43]:
countries = countries.loc[:,["Country", "Alpha-3 code"]]

In [44]:

df = df.merge(countries, left_on="country", right_on="Country")
df["s_score_total"] = 3
df["c_score_total"] = df.c_score_1 + df.c_score_2
df["o_score_total"] = 3
df["r_score_total"] = df.r_score_1 + df.r_score_2 + df.r_score_3 + df.r_score_4 + df.r_score_5 + df.r_score_6 + df.r_score_7
df["e_score_total"] = df.e_score_1 + df.e_score_2 + df.e_score_3 + df.e_score_4 + df.e_score_6 + df.e_score_7 + df.e_score_8 + df.e_score_9 + df.e_score_10 + df.e_score_11
df["em_score_total"] = df.em_score_1 + df.em_score_2

In [51]:
df.rename(columns={"Alpha-3 code":"alpha3code"}, inplace=True)

In [52]:
df.to_pickle("datasets/new_dummy_df.pkl")